from datetime import datetime

def analyze_timestamps(start_time, end_time):
    """
    Функция, которая принимает две строки с временными метками:
    start_time = "2025-09-26 10:5:00" и end_time = "2025-09-26 11:07:30".
    Вычисляет разницу между ними и возвращает результат в виде строки: 
    "Операция заняла: 12 минут 30 секунд.".
    
    Args:
        start_time (str): Начальное время в формате "ГГГГ-ММ-ДД ЧЧ:ММ:СС"
        end_time (str): Конечное время в формате "ГГГГ-ММ-ДД ЧЧ:ММ:СС"
        
    Returns:
        str: Строка с разницей во времени
    """
    pass